[
    {
        "id": 1,
        "name": "ail",
        "scientific_name" : "allium sativum",
        "sun": 2,
        "difficulty": 1,
        "water": 1,
        "icon": "ail.png",
        "image": "ail.png",
        "description": "L'ail (pluriel : ails ou aulx), ail commun ou ail cultivé (Allium sativum) est une espèce de plante potagère vivace monocotylédone dont les bulbes, à l'odeur et au goût forts, sont souvent employés comme condiment en cuisine. La tête d'ail se compose de plusieurs caïeux ou « gousses » d'ail. La fleur d'ail est aussi consommée. On en distingue plusieurs types. Originaire d'Asie centrale, il aurait été utilisé depuis 5 000 ans en région méditerranéenne, en particulier en Égypte. Il est aujourd'hui toujours très apprécié dans de nombreuses régions pour ses qualités gustatives et médicinales.",
        "size" : 0.15,
        "companion_pos" : "{9, 51, 49}",
        "companion_neg" : "{43, 30, 13, 14, 15, 16, 17, 18}",
        "type_id": 4
    },

    {
        "id": 2,
        "name": "fraise",
        "scientific_name" : "fragaria × ananassa",
        "sun": 2,
        "difficulty": 1,
        "water": 2,
        "icon": "fraise.png",
        "image": "fraise.png",
        "description": "Le fraisier cultivé (Fragaria ×ananassa), plus rarement appelé fraisier ananas, est une espèce hybride de fraisiers cultivée pour son fruit qui est la fraise de jardin. Ce fruit n'est en fait pas une baie au sens botanique, mais un faux-fruit. Il est mondialement apprécié pour son arôme caractéristique, sa couleur rouge brillant, sa texture juteuse, et sa douceur. Il est consommé en large quantité, à la fois frais ou incorporé dans des aliments préparés comme des confitures, des compotes, des jus de fruits, des tartes, des crèmes glacées, ou des milkshakes. Le Fraisier cultivé a été obtenu pour la première fois en Bretagne en France dans les années 1750 par croisement entre Fragaria virginiana de l'est de l'Amérique du Nord et Fragaria chiloensis qui a été rapporté du Chili par Amédée-François Frézier en 1714.",
        "size" : 0.2,
        "companion_pos" : "{30, 31, 41, 49}",
        "companion_neg" : "{15, 16, 17, 18}",
        "type_id": 6
    },

    {
        "id": 3,
        "name": "artichaut",
        "scientific_name" : "cynara cardunculus",
        "sun": 2,
        "difficulty": 3,
        "water": 1,
        "icon": "artichaut.png",
        "image": "artichaut.png",
        "description": "L’artichaut (Cynara cardunculus var. scolymus (L.) Benth.) est une plante dicotylédone de la famille des Astéracées (ou Composées) appartenant au genre Cynara. L'artichaut lui-même est un chardon domestiqué et cultivé, de l'espèce Cynara cardunculus, dont la variété sauvage est sans doute Cynara cardunculus var. sylvestris (Lamk.) Fiori, ayant donné naissance à deux formes : C. cardunculus f. cardunculus, le cardon, et C. cardunculus f. scolymus, l'artichaut2. Ces deux formes ont longtemps été considérées comme des espèces différentes. On désigne sous le nom d'artichaut à la fois la plante entière et sa partie comestible, l'inflorescence en capitule, appelée aussi tête d'artichaut. Le mot, apparu à la Renaissance, est emprunté à son nom arabe الأرضي-شوكي (ʾarḍiyy šawkiyy) par l'intermédiaire du lombard articiocco.",
        "size" : 5,
        "companion_pos" : "{}",
        "companion_neg" : "{}",
        "type_id": 3
    },

    {
        "id": 4,
        "name": "asperge",
        "scientific_name" : "asparagus officinalis",
        "sun": 2,
        "difficulty": 2,
        "water": 1,
        "icon": "asperge.png",
        "image": "asperge.png",
        "description": "L'asperge est une plante de la famille des Asparagaceae originaire de l'est du bassin méditerranéen. Connue des Romains, elle est cultivée comme plante potagère en France depuis le xve siècle. Le terme désigne aussi ses pousses comestibles, qui proviennent de rhizomes d'où partent chaque année les bourgeons souterrains ou turions qui donnent naissance à des tiges s'élevant entre 1 et 1,5 mètre.",
        "size" : 0.15,
        "companion_pos" : "{49}",
        "companion_neg" : "{35}",
        "type_id": 3
    },

    {
        "id": 5,
        "name": "aubergine",
        "scientific_name" : "solanum melongena",
        "sun": 3,
        "difficulty": 2,
        "water": 2,
        "icon": "aubergine.png",
        "image": "aubergine.png",
        "description": "L’aubergine (Solanum melongena L.) est une plante dicotylédone de la famille des Solanaceae, cultivées pour son légume-fruit. Le terme aubergine désigne la plante et le fruit. Elle est originaire d'Asie où elle fut domestiquée à l'époque préhistorique et constitue avec les aubergines africaines: S. aethiopicum L., aubergine amère, ou gilo, et S. macrocarpon L., ou gboma, les trois espèces d'aubergines cultivées. À la différence de la pomme de terre et de la tomate, ces solanacées de l'Ancien Monde suivent un parcours de mondialisation qui leur est propre. L'aubergine est un légume-fruit riche en composés phénoliques et alcaloïdes antioxydants aux effets favorables sur le syndrome métabolique, elle est l'objet de nombreuses publications scientifiques.",
        "size" : 0.5,
        "companion_pos" : "{43}",
        "companion_neg" : "{}",
        "type_id": 1
    },

    {
        "id": 6,
        "name": "blette",
        "scientific_name" : "beta vulgaris",
        "sun": 2,
        "difficulty": 1,
        "water": 3,
        "icon": "blette.png",
        "image": "blette.png",
        "description": "La bette ou côte de bette, également appelée blette dans la région de Nice, de Lyon ou en Limousin, bette à carde au Québec, et poirée en France4, bette à tondre, bette à côte5 ou côte6 en Suisse romande, jotte ou joute dans l'Ouest de la France, est une plante herbacée bisannuelle de la famille des Amaranthacées (ou Chénopodiacées en classification classique) cultivée comme plante potagère pour ses feuilles ou pour ses côtes (ou cardes), consommées comme légume. Le nom poirée vient du fait que la plante était utilisée pour la porée (purée de légumes dans la cuisine médiévale à base entre autres de poireau). Le nom jotte s'explique de même par le bas-latin jotta (bouillie de légumes, marmelade).",
        "size" : 0.4,
        "companion_pos" : "{9, 19, 34, 47, 30}",
        "companion_neg" : "{}",
        "type_id": 3
    },

    {
        "id": 7,
        "name": "betterave",
        "scientific_name" : "beta vulgaris ",
        "sun": 2,
        "difficulty": 1,
        "water": 3,
        "icon": "betterave.png",
        "image": "betterave.png",
        "description": "La betterave, Beta vulgaris subsp. vulgaris, est une sous-espèce de plantes de la famille des Amaranthaceae, cultivées pour leurs racines charnues, et utilisées pour la production du sucre, comme légume dans l'alimentation humaine, comme plantes fourragères, et plus récemment comme carburant avec le bioéthanol.",
        "size" : 0.15,
        "companion_pos" : "{10, 11, 13, 14, 15, 16, 17, 18, 31, 35}",
        "companion_neg" : "{30}",
        "type_id": 2
    },

    {
        "id": 8,
        "name": "cardon",
        "scientific_name" : "cynara cardunculus",
        "sun": 2,
        "difficulty": 3,
        "water": 1,
        "icon": "cardon.png",
        "image": "cardon.png",
        "description": "Le cardon est très proche de l’artichaut. On peut d’ailleurs également manger ses fleurs même si elles sont plus dures et ont un goût plus amer. Cependant ce sont plutôt les cardes qui sont consommées lorsqu’on choisi de cultiver les cardons au potager. Ce légume très fin a été un peu oublié notamment à cause du blanchiment des cardes rendu fastidieux par la présence de nombreuses épines. Ses feuilles bleutées et largement découpées sont parfaites pour agrémenter un massif comestible.",
        "size" : 0.75,
        "companion_pos" : "{}",
        "companion_neg" : "{}",
        "type_id": 3
    },

    {
        "id": 9,
        "name": "carotte",
        "scientific_name" : "Daucus carota",
        "sun": 2,
        "difficulty": 1,
        "water": 1,
        "icon": "carotte.png",
        "image": "carotte.png",
        "description": "La Carotte (Daucus carota subsp. sativus) est une plante bisannuelle de la famille des Apiacées (aussi appelées Ombellifères), largement cultivée pour sa racine pivotante charnue, comestible, de couleur généralement orangée, consommée comme légume. La carotte représente, après la pomme de terre, le principal légume-racine cultivé dans le monde2. C'est une racine riche en carotène.",
        "size" : 0.15,
        "companion_pos" : "{29, 25, 41, 47}",
        "companion_neg" : "{}",
        "type_id": 2
    },

    {
        "id": 10,
        "name": "céleri branche",
        "scientific_name" : "Apium graveolens",
        "sun": 2,
        "difficulty": 2,
        "water": 2,
        "icon": "celeri-branche.png",
        "image": "celeri-branche.png",
        "description": "Le céleri (Apium graveolens L.) ou ache des marais ou encore persil des marais, est une plante herbacée bisannuelle de la famille des Apiacées, cultivée comme plante potagère pour ses feuilles et sa racine tubérisée consommées comme légumes.",
        "size" : 0.3,
        "companion_pos" : "{29, 35, 41, 49}",
        "companion_neg" : "{31}",
        "type_id": 3
    },

    {
        "id": 11,
        "name": "céleri rave",
        "scientific_name" : "Apium graveolens",
        "sun": 2,
        "difficulty": 2,
        "water": 2,
        "icon": "celeri-rave.png",
        "image": "celeri-rave.png",
        "description": "Le céleri (Apium graveolens L.) ou ache des marais ou encore persil des marais, est une plante herbacée bisannuelle de la famille des Apiacées, cultivée comme plante potagère pour ses feuilles et sa racine tubérisée consommées comme légumes.",
        "size" : 0.3,
        "companion_pos" : "{29, 35, 41, 49}",
        "companion_neg" : "{31}",
        "type_id": 3
    },

    {
        "id": 12,
        "name": "chicorée",
        "scientific_name" : "cichorium endivia",
        "sun": 1,
        "difficulty": 1,
        "water": 2,
        "icon": "chicoree.png",
        "image": "chicoree-frisee.png",
        "description": "La chicorée endive (Cichorium endivia L.) est une espèce de plantes herbacées de la famille des Asteraceae. Il en existe plusieurs variétés, notamment les scaroles à feuilles larges et les frisées à feuilles plus découpées. Elles sont couramment cultivées comme plantes potagères, principalement pour consommer leurs feuilles en salade ou cuites. Cette espèce est l'« endive vraie » au sens strict de la botanique. Elle ne doit pas être confondue avec l'endive des étals. Cette dernière, appelée « chicon » en Belgique et dans le Nord de la France, est en fait issue de l'espèce Cichorium intybus, la chicorée sauvage ou amère, une chicorée très proche de Cichorium endivia, qui ne s'en distingue que par des détails morphologiques minimes",
        "size" : 0.3,
        "companion_pos" : "{7, 27, 30, 43, 49}",
        "companion_neg" : "{10, 11, 15, 16, 17, 18}",
        "type_id": 3
    },

    {
        "id": 13,
        "name": "chou pak-choi",
        "scientific_name" : "Brassica rapa",
        "sun": 2,
        "difficulty": 2,
        "water": 2,
        "icon": "chou-pak-choi.png",
        "image": "chou-pak-choi.png",
        "description": "De la même famille que le navet (Brassica rapa), le choux chinois Pak-choï a un goût doux et léger. Ce légume est représenté par de nombreuses variétés au port plus ou moins compact. N’hésitez pas à cultiver le chou chinois PAK-CHOI au potager en permaculture pour varier votre alimentation. Les jeunes feuilles se consomment crues, les côtes et les feuilles plus agées cuites. Moins sensible à la montée en graine que son collègue le chou chinois Pé-tsaï, la chou Pak-choï ne pomme pas et sa période de culture est plus étendue.",
        "size" : 0.2,
        "companion_pos" : "{}",
        "companion_neg" : "{}",
        "type_id": 3
    },

    {
        "id": 14,
        "name": "chou pét-saï",
        "scientific_name" : "Brassica rapa",
        "sun": 2,
        "difficulty": 2,
        "water": 2,
        "icon": "chou-pe-tsai.png",
        "image": "chou-pe-tsai.png",
        "description": "Le choux chinois Pé-tsaï (chou de Pékin) a un goût doux et sucré. Il est de la même espèce que le navet (Brassica rapa). C’est un excellent complément au potager pour une alimentation diversifiée. Il est tout à fait possible de cultiver le chou chinois PE-TSAI au potager en permaculture sous nos latitudes. Il est sensible à la montée en graine lorsqu’il fait trop chaud, ou trop froid. C’est pourquoi il est important de choisir la bonne période de plantation",
        "size" : 0.4,
        "companion_pos" : "{}",
        "companion_neg" : "{}",
        "type_id": 3
    },

    {
        "id": 15,
        "name": "chou de Bruxelles",
        "scientific_name" : "brassica oleracea",
        "sun": 2,
        "difficulty": 3,
        "water": 3,
        "icon": "chou-de-bruxelles.png",
        "image": "chou-de-bruxelles.png",
        "description": "Le chou de Bruxelles (Brassica oleracea var. gemmifera) est une variété de chou, plante herbacée de la famille des Brassicaceae (sous-famille des Brassicoideae), cultivée pour ses bourgeons axillaires qui forment de petites têtes pommées, consommées comme légume. Le terme désigne aussi ce légume. Les bourgeons à l’aisselle des fleurs forment de petites pommes, composées de nombreuses feuilles désassemblées. Ils sont récoltés en automne ou en hiver (selon le climat), par intervalles, en commençant par le bas, où ils sont plus avancés.",
        "size" : 0.5,
        "companion_pos" : "{7, 10, 11, 29, 35, 45}",
        "companion_neg" : "{2, 49, 51}",
        "type_id": 3
    },

    {
        "id": 16,
        "name": "chou cabu",
        "scientific_name" : "brassica oleracea",
        "sun": 2,
        "difficulty": 2,
        "water": 2,
        "icon": "chou-cabu.png",
        "image": "chou-cabu.png",
        "description": "Le chou cabus ou chou pommé (Brassica oleracea var. capitata ou Brassica oleracea Groupe Capitata) est une variété de chou caractérisée par une tête et un feuillage lisse. Cultivé en Europe depuis le VIIIème siècle, ce n’est qu’au XIème siècle que la sélection a permis une différenciation entre choux blancs et rouges. De plus, les choux rouges sont plus tardifs que les choux blancs. Riches en protéines, ils le sont également en vitamines C, B1 et B2.",
        "size" : 0.5,
        "companion_pos" : "{7, 10, 11, 29, 35, 45}",
        "companion_neg" : "{2, 49, 51}",
        "type_id": 3
    },

    {
        "id": 17,
        "name": "chou brocoli",
        "scientific_name" : "brassica oleracea",
        "sun": 2,
        "difficulty": 3,
        "water": 2,
        "icon": "chou-brocoli.png",
        "image": "chou-brocoli.png",
        "description": "Le brocoli est une variété de chou originaire de Sicile. Il fut sélectionné par les Romains à partir du chou sauvage. Ceux-ci l'appréciaient beaucoup et la cuisine italienne l'utilise beaucoup. Le brocoli présente une tige centrale ferme ramifiée en petits bouquets qui, à la floraison, sont parsemés de minuscules fleurs jaunes. On le cueille avant l'éclosion de ses fleurs jaunes. Le mot « brocoli » est dérivé du latin bracchium signifiant « branche », en référence à la forme du légume qui fait penser à des arbres miniatures. Habituellement de couleur vert foncé à vert sauge, le brocoli peut aussi être blanc ou pourpre (violacé).",
        "size" : 0.5,
        "companion_pos" : "{7, 10, 11, 29, 35, 45}",
        "companion_neg" : "{2, 49, 51}",
        "type_id": 3
    },

    {
        "id": 18,
        "name": "chou-fleur",
        "scientific_name" : "brassica oleracea",
        "sun": 2,
        "difficulty": 3,
        "water": 2,
        "icon": "chou-fleur.png",
        "image": "chou-fleur.png",
        "description": "Le chou-fleur est une variété de choux de la famille des Brassicacées, cultivée comme plante potagère pour son méristème floral hypertrophié et charnu, consommé comme légume. Le terme désigne aussi ce légume. Le chou-fleur était connu et apprécié dans l'Antiquité en Grèce et à Rome1. En France, il est peu consommé par les élites pendant tout le Moyen Âge mais sa popularité en Italie va le rendre à la mode à partir de la Renaissance1. On l'appelle alors chou de Chypre ou chou de Syrie. Les rois Louis XIV et Louis XV en étaient friands et plusieurs recettes ont été créées à la cour, telle que le « potage à la du Barry ». Cependant sa culture ne se développe en France qu'à partir de 1830.",
        "size" : 0.5,
        "companion_pos" : "{7, 10, 11, 29, 35, 45}",
        "companion_neg" : "{2, 49, 51}",
        "type_id": 3
    },

    {
        "id": 19,
        "name": "chou rave",
        "scientific_name" : "brassica oleracea",
        "sun": 2,
        "difficulty": 2,
        "water": 2,
        "icon": "chou-rave.png",
        "image": "chou-rave.png",
        "description": "Le chou-rave est une variété de chou, plante herbacée bisannuelle de la famille des brassicacées, cultivée comme plante potagère pour la base de sa tige renflée, consommée comme légume. Le chou-rave est un peu délaissé en France pour avoir été un aliment de guerre (parfois connu alors sous son nom allemand de Kohlrabi ou colrave), sort qu'il partage avec le topinambour et le rutabaga. En revanche, dans certaines régions du Canada, on le retrouve couramment dans les épiceries. On lui prête des vertus aphrodisiaques.",
        "size" : 0.2,
        "companion_pos" : "{7, 9, 30}",
        "companion_neg" : "{28}",
        "type_id": 3
    },

    {
        "id": 20,
        "name": "ciboule",
        "scientific_name" : "allium fistulosum",
        "sun": 2,
        "difficulty": 2,
        "water": 1,
        "icon": "ciboule.png",
        "image": "ciboule.png",
        "description": "La ciboule, cive1 ou oignon d'hiver, est une espèce (Allium fistulosum) de plantes herbacées vivaces de la famille des Amaryllidacées (ex Liliacées). Elle est cultivée pour ses feuilles aromatiques, au goût plus doux que l'oignon ou l'échalote, et utilisée en cuisine comme légume ou comme aromate . En Provence et dans le Sud-Est de la France, elle est connue sous le nom de cébette et récoltée avant renflement des bulbes.",
        "size" : 0.15,
        "companion_pos" : "{9}",
        "companion_neg" : "{30, 42, 43}",
        "type_id": 3
    },

    {
        "id": 21,
        "name": "concombre",
        "scientific_name" : "cucumis sativus",
        "sun": 3,
        "difficulty": 2,
        "water": 2,
        "icon": "concombre.png",
        "image": "concombre.png",
        "description": "Le concombre (Cucumis sativus) est une plante potagère herbacée, rampante, de la même famille que la calebasse africaine, le melon ou la courge (famille des Cucurbitacées). C'est botaniquement un fruit qui est consommé comme un légume. Il est de la même espèce (Cucumis sativus) que le cornichon, consommé lui comme condiment1. La plante, qui poussait naturellement au pied de l'Himalaya, aurait été domestiquée pour la première fois en Inde il y a au moins 3 000 ans.",
        "size" : 0.75,
        "companion_pos" : "{29, 30, 31, 43, 49}",
        "companion_neg" : "{}",
        "type_id": 1
    },

    {
        "id": 22,
        "name": "cornichon",
        "scientific_name" : "cucumis sativus",
        "sun": 3,
        "difficulty": 2,
        "water": 2,
        "icon": "cornichon.png",
        "image": "cornichon.png",
        "description": "Le cornichon est une plante herbacée annuelle de la famille des Cucurbitaceae, cultivée pour ses fruits, récoltés avant maturité et consommés principalement comme condiment. Le nom scientifique est Cucumis sativus, le même que celui du concombre (ils sont tous deux de la même espèce). Historiquement, le concombre était récolté à maturité, à la différence du cornichon, puis des variétés ont été sélectionnées pour produire des cornichons et d'autres des concombres. Les sélections effectuées par l'homme ont accentué les caractères propres à chacun, pour obtenir des cultivars distincts.",
        "size" : 0.75,
        "companion_pos" : "{29, 30, 31, 43, 49}",
        "companion_neg" : "{47}",
        "type_id": 1
    },

    {
        "id": 23,
        "name": "courge",
        "scientific_name" : "cucurbita pepo",
        "sun": 2,
        "difficulty": 1,
        "water": 2,
        "icon": "courge.png",
        "image": "courge.png",
        "description": "Le terme courge, ou plus rarement cougourde, désigne plusieurs espèces de plantes de la famille des cucurbitacées. Elles sont généralement cultivées pour leurs fruits comestibles mais il arrive qu'elles le soient pour leurs graines oléagineuses. Le terme désigne également leurs fruits, qui ont la propriété de se conserver facilement à maturité et qui sont utilisés en cuisine comme un légume ou donnés aux animaux.",
        "size" : 2,
        "companion_pos" : "{29, 30, 33, 43, 47}",
        "companion_neg" : "{45}",
        "type_id": 1
    },

    {
        "id": 24,
        "name": "courgette",
        "scientific_name" : "Cucurbita pepo",
        "sun": 2,
        "difficulty": 1,
        "water": 2,
        "icon": "courgette.png",
        "image": "courgette.png",
        "description": "La courgette est une plante herbacée de la famille des Cucurbitaceae, c'est aussi le fruit comestible de la plante du même nom. La courgette est un fruit courant en été, la fleur de courgette est aussi utilisée en cuisine. Les différentes variétés de courgettes sont des cultivars de l'espèce Cucurbita pepo, et de la sous-espèce Cucurbita pepo subsp. pepo dont fait partie aussi la citrouille véritable.",
        "size" : 1,
        "companion_pos" : "{29, 30, 33, 43, 47}",
        "companion_neg" : "{45}",
        "type_id": 1
    },

    {
        "id": 25,
        "name": "échalote",
        "scientific_name" : "allium cepa",
        "sun": 2,
        "difficulty": 1,
        "water": 1,
        "icon": "echalote.png",
        "image": "echalote.png",
        "description": "L'échalote ( Allium cepa L. var. aggregatum G. Don., anciennement Allium ascalonicum L., synonyme : Allium hierochuntinum Boiss.) est une plante bulbeuse de la famille des Amaryllidacées1 (précédemment Liliacées), cultivée comme plante condimentaire et potagère. Le terme désigne aussi le bulbe lui-même, qui fait partie depuis longtemps de la gastronomie française. Au Québec et au Nouveau-Brunswick, elle est appelée « échalote française » (le mot « échalote » étant plutôt utilisé pour nommer la cébette).",
        "size" : 0.15,
        "companion_pos" : "{}",
        "companion_neg" : "{30 , 43}",
        "type_id": 4
    },

    {
        "id": 26,
        "name": "endive",
        "scientific_name" : "cichorium intybus",
        "sun": 1,
        "difficulty": 3,
        "water": 2,
        "icon": "endive.png",
        "image": "endive.png",
        "description": "L’endive (Cichorium intybus L. var. foliosum Hegi), nom commun de la chicorée de Bruxelles ou chicorée Witloof, appelée aussi chicon dans le Nord de la France, au Luxembourg et en Belgique, est une variété de chicorée amère (Cichorium intybus), plante bisannuelle de la famille des Astéracées, mais différente de celle qui donne la chicorée à café (Cichorium intybus var. sativum). Contrairement à ce que son nom usuel pourrait laisser croire, cette salade n'est pas une variété issue de l'« endive vraie » des botanistes, une espèce voisine nommée Cichorium endivia L. qui donne les chicorées scaroles et frisées.",
        "size" : 0.2,
        "companion_pos" : "{7, 27, 30, 43, 49}",
        "companion_neg" : "{10, 11, 15, 16, 17, 18}",
        "type_id": 3
    },

    {
        "id": 27,
        "name": "épinard",
        "scientific_name" : "spinacia oleracea",
        "sun": 2,
        "difficulty": 1,
        "water": 2,
        "icon": "epinard.png",
        "image": "epinard.png",
        "description": "L'épinard (Spinacia oleracea) est une plante potagère, annuelle ou bisannuelle, de la famille des Chenopodiaceae ou des Amaranthaceae selon les classifications. Originaire d'Iran (il tire son nom du persan āsfanāǧ), il est aujourd'hui cultivé dans toutes les régions tempérées pour ses qualités nutritionnelles.",
        "size" : 0.2,
        "companion_pos" : "{5, 10, 11, 35, 41, 51}",
        "companion_neg" : "{}",
        "type_id": 3
    },

    {
        "id": 28,
        "name": "fenouil",
        "scientific_name" : "foeniculum vulgare",
        "sun": 2,
        "difficulty": 3,
        "water": 3,
        "icon": "fenouil.png",
        "image": "fenouil.png",
        "description": "Le fenouil ou fenouil commun (Foeniculum vulgare, syn. Foeniculum officinale) est une plante généralement vivace parfois bisannuelle de la famille des apiacées (ombellifères). Les variétés cultivées de cette espèce de fenouil sont utilisées en alimentation pour le renflement bulbeux et charnu de leurs feuilles imbriquées les unes dans les autres. Ce n'est pas un bulbe véritable (comme l'oignon). Cette plante s'est naturalisée à travers le monde principalement dans les biomes au climat méditerranéen.",
        "size" : 0.2,
        "companion_pos" : "{12, 21, 31}",
        "companion_neg" : "{19, 30, 49}",
        "type_id": 3
    },

    {
        "id": 29,
        "name": "fève",
        "scientific_name" : "vicia faba ",
        "sun": 2,
        "difficulty": 1,
        "water": 1,
        "icon": "feve.png",
        "image": "feve.png",
        "description": "Les fèves sont des plantes annuelles légumineuses de la famille des Fabaceae, sous-famille des Faboideae, tribu des Fabeae. Comme les fèveroles, les fèves cultivées ont comme origine l'espèce botanique Vicia faba. Le terme désigne aussi la graine qui, consommée à l'état frais ou sec, est l'un des légumes les plus anciennement cultivés. On la cultive pour ses graines comestibles, tout particulièrement autour du Bassin méditerranéen ainsi que maintenant dans de très nombreux pays où elle est utilisée fraîche ou sèche. En Russie, en Égypte et au Canada, elle fait partie de la cuisine traditionnelle. Consommée en grande quantité, la fève peut provoquer des crises de favisme chez les personnes sensibles.",
        "size" : 0.2,
        "companion_pos" : "{7, 9, 33, 23, 51, 49, 15, 16, 17, 18}",
        "companion_neg" : "{28, 1, 41}",
        "type_id": 1
    },

    {
        "id": 30,
        "name": "haricot",
        "scientific_name" : "phasoleus vulgaris",
        "sun": 2,
        "difficulty": 1,
        "water": 2,
        "icon": "haricot.png",
        "image": "haricot.png",
        "description": "Les haricots verts sont des gousses immatures du haricot commun (Phaseolus vulgaris) consommées comme légumes. Selon les variétés, leur couleur peut varier entre le jaune (haricots « beurre »), le vert et le violet.",
        "size" : 0.2,
        "companion_pos" : "{7, 9, 33, 23, 51, 49, 15, 16, 17, 18}",
        "companion_neg" : "{28, 1, 41}",
        "type_id": 1
    },

    {
        "id": 31,
        "name": "laitue",
        "scientific_name" : "lactuca sativa",
        "sun": 2,
        "difficulty": 1,
        "water": 2,
        "icon": "laitue.png",
        "image": "laitue.png",
        "description": "La Laitue (Lactuca), au sens botanique du terme, est un genre de plantes annuelles et bisannuelles1 de la famille des Astéracées (Composées) dont certaines espèces sont cultivées pour leurs feuilles tendres consommées comme salade verte. Ce genre comprend plus de 100 espèces. La laitue la plus cultivée est la laitue cultivée (Lactuca sativa) à partir de laquelle les jardiniers ont sélectionné de nombreuses variétés et cultivars.",
        "size" : 0.2,
        "companion_pos" : "{7, 15, 16, 17, 18, 29, 43}",
        "companion_neg" : "{}",
        "type_id": 3
    },

    {
        "id": 32,
        "name": "mâche",
        "scientific_name" : "valerianella locusta",
        "sun": 2,
        "difficulty": 1,
        "water": 2,
        "icon": "mache.png",
        "image": "mache.png",
        "description": "La mâche (Valerianella locusta), aussi appelée blanchette, boursette1, clairette, raiponce1, oreillette ou oreille-de-lièvre1, valérianelle, valérianelle cultivée, herbe des chanoines, en Belgique, salade de blé, dans le Midi de la France, doulcéta, doucette, gallinette, poule grasse (les volailles dans les cours de ferme s'en nourrissaient volontiers), ou en Savoie et en Suisse romande, rampon, ramponnet, est une petite plante herbacée annuelle de la famille des Caprifoliaceae (anciennement Valerianaceae), originaire de l’Afrique, de l’Amérique du Nord et de l’Eurasie. C'est de cette espèce que sont issues les variétés cultivées consommées le plus souvent crues en salades.",
        "size" : 0.15,
        "companion_pos" : "{}",
        "companion_neg" : "{}",
        "type_id": 3
    },

    {
        "id": 33,
        "name": "maïs",
        "scientific_name" : "zea mays",
        "sun": 2,
        "difficulty": 2,
        "water": 2,
        "icon": "mais.png",
        "image": "mais.png",
        "description": "Le maïs, originaire du Mexique, constituait l'aliment de base des Amérindiens avant l'arrivée en Amérique de Christophe Colomb. La plante fut divinisée dans les anciennes civilisations d’Amérique centrale et méridionale, et était cultivée par les Nord-Amérindiens avec la courge et le haricot en utilisant la technique dite « des trois sœurs ». Introduite en Europe au xvie siècle, elle est aujourd’hui la première céréale cultivée dans le monde devant le riz et le blé.",
        "size" : 0.3,
        "companion_pos" : "{29, 42, 43, 23}",
        "companion_neg" : "{}",
        "type_id": 1
    },

    {
        "id": 34,
        "name": "navet",
        "scientific_name" : "brassica rapa",
        "sun": 2,
        "difficulty": 2,
        "water": 2,
        "icon": "navet.png",
        "image": "navet.png",
        "description": "Le navet, Brassica rapa L. subsp. rapa, est une plante herbacée de la famille des Brassicacées, cultivée comme plante potagère ou fourragère pour sa racine charnue allongée ou arrondie, consommée comme légume. Le terme désigne aussi ce légume. Il a probablement été domestiqué indépendamment en Chine et en Europe de l'Est. La racine est renflée et charnue, très variable dans sa forme : cylindrique, conique, sphérique, piriforme, allongée ou aplatie, et dans sa couleur : jaune pâle, blanche, grise ou noire, bicolore rose-blanc… Elle est quelquefois plus ou moins sucrée, d'autres fois piquante et un peu âcre.",
        "size" : 0.2,
        "companion_pos" : "{31, 43, 42}",
        "companion_neg" : "{}",
        "type_id": 2
    },

    {
        "id": 35,
        "name": "oignon",
        "scientific_name": "allium cepa",
        "sun":2,
        "difficulty":1,
        "water":1,
        "icon":"oignon.png",
        "image":"oignon.png",
        "description": "L'oignon est une espèce de plantes herbacées bisannuelles de la famille des Amaryllidaceae, largement et depuis longtemps cultivée comme plante potagère pour ses bulbes de saveur et d'odeur fortes ou pour ses feuilles. Le terme désigne aussi le bulbe de cette plante récolté comme légume. Par extension, il désigne parfois familièrement en jardinage les bulbes d'autres plantes, généralement non comestibles (par exemple : oignon de tulipe). L'oignon est utilisé à la fois comme légume et comme condiment.",
        "size": 0.15,
        "companion_pos": "{7, 15, 16, 17, 18, 9, 31, 45}",
        "companion_neg": "{29, 30, 43}",
        "type_id":4
    },

    {
        "id": 36,
        "name": "oseille",
        "scientific_name": "rumex acetosa",
        "sun":1,
        "difficulty":1,
        "water":2,
        "icon":"oseille.png",
        "image":"oseille.png",
        "description": "l'oseille, appelée aussi Patience ou Rumex, est un genre de lantes herbacées dicotylédones de la famille des Polygonacées (comprenant notamment le sarrasin et la rhubarbe), poussant à l'état sauvage en Afrique, Europe et en Asie du Nord, ainsi qu'en Amérique du Nord, dont plusieurs espèces sont cultivées comme plantes potagères pour leurs feuilles comestibles.",
        "size": 0.30,
        "companion_pos": "{}",
        "companion_neg": "{6, 8, 27}",
        "type_id":3
    },

    {
        "id": 37,
        "name": "panais",
        "scientific_name": "Pastinaca sativa L.",
        "sun":2,
        "difficulty":1,
        "water":2,
        "icon":"panais.png",
        "image":"panais.png",
        "description": "Le Panais est une espèce de plante herbacée bisannuelle à racine charnue originaire d'Europe, appartenant à la famille des Apiacées (anciennement Ombellifères). Il fut autrefois très cultivé (sa sous-espèce Pastinaca sativa subsp. sativa) comme légume et comme plante fourragère. C'était une culture quelque peu délaissée, sauf en Grande-Bretagne, dans les pays nordiques et en Afrique du Nord. Le panais, détrôné par la pomme de terre, est de retour sur la table française depuis la fin du xxe siècle à la suite de sa réintroduction sur les étals par les maraîchers biologiques et l'engouement pour les légumes anciens. Le panais est d'ailleurs aujourd'hui, avec le rutabaga et le topinambour, l'un des rares légumes « oubliés » présents en frais pratiquement à longueur d'année mais surtout en hiver dans les magasins et marchés. Le panais, d'une couleur blanc ivoire, a une forme proche de celle de la carotte, et un goût légèrement sucré, noiseté, avec un arôme épicé.",
        "size": 0.30,
        "companion_pos": "{}",
        "companion_neg": "{31}",
        "type_id":2
    },

    {
        "id": 38,
        "name": "pastèque",
        "scientific_name": "Citrullus lanatus",
        "sun":3,
        "difficulty":2,
        "water":2,
        "icon":"pasteque.png",
        "image":"pasteque.png",
        "description": "La pastèque aussi appelée melon d'eau, est une espèce de plantes herbacées de la famille des Cucurbitacées, originaire d'Afrique de l'Ouest, largement cultivée pour ses gros fruits lisses, à chair rouge, jaune, verdâtre ou blanche et à graines noires ou rouges. Le terme désigne également ce fruit. Le fruit pèse généralement, à maturité, entre 2 et 5 kg. Il faut distinguer la pastèque consommable crue de la pastèque à confiture ou « citre » qui doit être cuite. Cette dernière est aussi communément appelée « courge gigérine » ou « courge barbarine » dans le sud de la France et « melons de Moscovie » en Charentes.",
        "size": 0.75,
        "companion_pos": "{}",
        "companion_neg": "{}",
        "type_id":6
    },

    {
        "id": 39,
        "name": "patate douce",
        "scientific_name" : "ipomoea batatas",
        "sun": 3,
        "difficulty": 1,
        "water": 1,
        "icon": "patate-douce.png",
        "image": "patate-douce.png",
        "description": "La patate (Ipomoea batatas), ou patate douce Écouter, est une espèce de plantes dicotylédones de la famille des Convolvulaceae, tribu des Ipomoeeae, vraisemblablement originaire d'Amérique tropicale. C'est une plante herbacée vivace dont la culture est très répandue dans toutes les régions tropicales et subtropicales, où on la cultive principalement pour ses tubercules (racines tubérisées) comestibles, riches en amidon. Le terme « patate » désigne aussi par métonymie les tubercules produits par cette plante. La patate est un cultigène hexaploïde, inconnu à l'état sauvage, cependant on a découvert en Amérique du Sud des formes sauvages tétraploïdes d’Ipomoea batatas.",
        "size" : 1,
        "companion_pos" : "{31}",
        "companion_neg" : "{}",
        "type_id": 2
    },

    {
        "id": 40,
        "name": "piment",
        "scientific_name" : "Capsicum",
        "sun": 3,
        "difficulty": 2,
        "water": 2,
        "icon": "piment.png",
        "image": "piment.png",
        "description": "Le terme piment (vert, jaune, orange, rouge, brun, pêche ou violet) est un nom vernaculaire désignant le fruit de cinq espèces de plantes du genre Capsicum de la famille des Solanacées et de plusieurs autres taxons. Le mot désigne plus communément le fruit de ces plantes, utilisés comme condiment ou légume (en français canadien, le mot piment désigne parfois les poivrons, les autres variétés de Capsicum, au goût plus piquant, étant appelés piments forts). La notion de piment est généralement associée à la saveur de piquant.",
        "size" : 0.4,
        "companion_pos" : "{1, 31}",
        "companion_neg" : "{45, 49, 5}",
        "type_id": 6
    },

    {
        "id": 41,
        "name": "poireau",
        "scientific_name" : "Allium ampeloprasum var. porrum",
        "sun": 2,
        "difficulty": 2,
        "water": 2,
        "icon": "poireau.png",
        "image": "poireau.png",
        "description": "Le poireau cultivé (Allium ampeloprasum var. porrum, anciennement Allium porrum) est une espèce de plante herbacée vivace largement cultivée comme plante potagère pour ses feuilles (pseudo-tiges) consommées comme légumes.",
        "size" : 0.15,
        "companion_pos" : "{9}",
        "companion_neg" : "{1, 20, 25, 35}",
        "type_id": 3
    },

    {
        "id": 42,
        "name": "pois chiche",
        "scientific_name" : "Cicer arietinum",
        "sun": 2,
        "difficulty": 1,
        "water": 1,
        "icon": "pois-chiche.png",
        "image": "pois-chiche.png",
        "description": "Cicer arietinum, le pois chiche, est une espèce de plantes dicotylédones de la famille des Fabaceae (légumineuses), sous-famille des Faboideae, originaire vraisemblablement de Méditerranée orientale. C'est une plante herbacée annuelle, cultivée pour ses graines comestibles, les pois-chiches. Le pois chiche détient un double record : haute teneur en glucides assimilables et pourcentage élevé en protéines végétales.",
        "size" : 0.2,
        "companion_pos" : "{37}",
        "companion_neg" : "{1, 20, 25, 35}",
        "type_id": 1
    },

    {
        "id": 43,
        "name":"pois",
        "scientific_name": "pisum sativum",
        "sun":2,
        "difficulty":1,
        "water":2,
        "icon":"pois.png",
        "image":"pois.png",
        "description": " Le Pois cultivé (Pisum sativum L.) est une espèce de plante annuelle de la famille des légumineuses (Fabacées), largement cultivée pour ses graines, consommée comme légume ou utilisée comme aliment du bétail. Le terme désigne aussi la graine elle-même, riche en énergie (amidon) et en protéines (de 16 à 40 %). Les pois secs se présentent souvent sous la forme de « pois cassés ». Les pois frais, récoltés avant maturité, sont plus couramment appelés « petits pois ». Le pois est cultivé depuis l'époque néolithique et a accompagné les céréales dans l'apparition de l'agriculture au Proche-Orient. Il était dans l'Antiquité et au Moyen  ge un aliment de base en Europe et dans le bassin méditerranéen. De nos jours, sa culture est pratiquée dans les cinq continents, particulièrement dans les régions de climat tempéré d'Eurasie et d'Amérique du Nord.",
        "size": 0.4,
        "companion_pos": "{9, 27, 15, 16, 17, 18, 34, 47}",
        "companion_neg": "{1, 35, 25}",
        "type_id":1
    },

    {
        "id": 44,
        "name":"poivron",
        "scientific_name": "capsicum annuum",
        "sun":3,
        "difficulty":2,
        "water":2,
        "icon":"poivron.png",
        "image":"poivron.png",
        "description": " Le poivron est un terme souvent utilisé pour caractériser des variétés de piments doux de l'espèce Capsicum annuum à très gros fruits (parfois appelé piment au Québec). C'est une plante annuelle de la famille des Solanacées originaire du Mexique, d'Amérique centrale et d'Amérique du Sud. La plante est cultivée comme plante potagère pour ses fruits consommés, crus ou cuits, comme légumes. Le terme désigne à la fois le fruit et la plante. Le poivron est l'ingrédient indispensable d'un certain nombre de plats, comme la piperade ou la ratatouille, mais il peut aussi bien servir d'accompagnement. Les graines de poivrons ont été importées en Espagne pour la première fois en 1493, et se sont propagées vers l'Europe et l'Asie. L'appellation poivron est dérivée du mot poivre, et fait son apparition à l'écrit en 1785.",
        "size": 0.4,
        "companion_pos": "{47, 31}",
        "companion_neg": "{ }",
        "type_id":1
    },

    {
        "id": 45,
        "name":"pomme de terre",
        "scientific_name": "solanum tuberosum",
        "sun":2,
        "difficulty":1,
        "water":2,
        "icon":"pomme-de-terre.png",
        "image":"pomme-de-terre.png",
        "description": " La pomme de terre ou patate (langage familier, canadianisme et belgicisme), est un tubercule comestible produit par l’espèce Solanum tuberosum, appartenant à la famille des solanacées. Le terme désigne également la plante elle-même, plante herbacée, vivace par ses tubercules mais toujours cultivée comme une culture annuelle. La pomme de terre est une plante qui réussit dans la plupart des sols, mais elle préfère les sols légers légèrement acides. La plante est sujette aux maladies dans des sols calcaires ou manquant d’humus.",
        "size": 0.4,
        "companion_pos": "{1, 31, 43, 23}",
        "companion_neg": "{49, 44, 5}",
        "type_id":4
    },

    {
        "id": 46,
        "name": "radis d’hiver",
        "scientific_name": "raphanus sativus",
        "sun": 2,
        "difficulty":1,
        "water":2,
        "icon":"radis-hiver.png",
        "image":"radis-hiver.png",
        "description": "Le radis noir, ou radis d'Espagne, radis d'hiver, raifort des Parisiens, raifort cultivé (Raphanus sativus var. niger (Mill.) J.Kern.) est une plante herbacée de la famille des brassicacées à racine pivotante, utilisée dans l'alimentation humaine et en phytothérapie. Le radis d’hiver fait partie de la famille des brassicacées, comme le chou rave, le brocoli, le navet ou le radis de tous les mois. Il se récolte tardivement l’automne et se conserve plusieurs mois dans un endroit approprié. Cultiver le radis d’hiver au potager est intéressant puisqu’il permet de diversifier l’alimentation dans une période aux récoltes modestes. Si le radis noir est plutôt piquant, certaines variétés de radis asiatiques sont quant à eux doux et peuvent être mangés en salade, râpés.",
        "size": 0.4,
        "companion_pos": "{2, 29, 15, 16, 17, 18, 43, 31, 23, 49}",
        "companion_neg": "{}",
        "type_id":2
    },

    {
        "id": 47,
        "name": "radis",
        "scientific_name" : "raphanus sativus",
        "sun": 2,
        "difficulty": 1,
        "water": 3,
        "icon": "radis.png",
        "image": "radis.png",
        "description": "Le radis cultivé, Raphanus sativus (du latin radix, radicis, « racine, raifort » rave, navet ») est une plante potagère annuelle ou bisannuelle de la famille des Brassicacées, principalement cultivée pour son hypocotyle charnu, souvent consommé cru, comme légume.",
        "size" : 0.25,
        "companion_pos" : "{2, 29, 15, 16, 17, 18, 43, 31, 23, 49}",
        "companion_neg" : "{}",
        "type_id": 2
    }, 

    {
        "id": 48,
        "name": "salsifi",
        "scientific_name" : "tragopogon porrifolium",
        "sun": 2,
        "difficulty": 1,
        "water": 2,
        "icon": "salsify.png",
        "image": "salsify.png",
        "description": "Tragopogon, les salsifis, est un genre de plantes herbacées appartenant à la famille des Astéracées (ou Composées). Il en existe diverses espèces sauvages, souvent méditerranéennes, mais on connaît surtout le salsifis cultivé (Tragopogon porrifolius), dont on consomme les racines cuites et les jeunes pousses en salade. Il faut cependant préciser que la plupart des salsifis consommés actuellement appartiennent en fait au genre des scorsonères (Scorzonera), qui ont un goût similaire. De Candolle indique que le mot salsifi viendrait de l'italien sassefrica : \"qui frotte les pierres\" et ajoute que ce sens n'aurait rien de raisonnable.",
        "size" : 0.3,
        "companion_pos" : "{35, 41, 31, 9}",
        "companion_neg" : "{26, 50}",
        "type_id": 2
    },

    {
        "id": 49,
        "name": "tomate",
        "scientific_name" : "solanum lycopersicum",
        "sun": 3,
        "difficulty": 2,
        "water": 2,
        "icon": "tomate.png",
        "image": "tomate.png",
        "description": "La tomate (Solanum lycopersicum L.) est une espèce de plantes herbacées du genre Solanum de la famille des Solanacées, originaire du Nord-Ouest de l'Amérique du Sud, largement cultivée pour son fruit. Le terme désigne aussi ce fruit charnu. La tomate se consomme comme un légume-fruit, crue ou cuite. Elle est devenue un élément incontournable de la gastronomie dans de nombreux pays, et tout particulièrement dans le bassin méditerranéen. L'espèce compte quelques variétés botaniques, dont la « tomate-cerise » et plusieurs milliers de variétés cultivées (cultivars identifiés par des appellations ou des marques commerciales).",
        "size" : 0.7,
        "companion_pos" : "{2, 9, 27, 35, 41, 31}",
        "companion_neg" : "{7, 33, 45}",
        "type_id": 1
    },

    {
        "id": 50,
        "name": "topinambour",
        "scientific_name" : "helianthus tuberosus",
        "sun": 2,
        "difficulty": 1,
        "water": 1,
        "icon": "topinambour.png",
        "image": "topinambour.png",
        "description": "Le topinambour (bot. Helianthus tuberosus L., 1753), aussi appelé artichaut de Jérusalem, truffe du Canada ou soleil vivace, est une plante vivace de la famille des astéracées, dont l'espèce appartient au même genre que le tournesol (Helianthus annuus). Elle est cultivée pour ses tubercules comestibles",
        "size" : 1,
        "companion_pos" : "{}",
        "companion_neg" : "{}",
        "type_id": 2
    }    

]